const devicesSampleData = [
  {
    "name":
        "موتورخانه 1موتورخانه 1موتورخانه 1موتورخانه 1موتورخانه 1موتورخانه 1موتورخانه 1 1",
    "status": "فعال",
    "city": "تهران",
    "device_id": 1,
  },
  {
    "name": "موتورخانه 2",
    "status": "غیرفعال",
    "city": "آملآملآملآملآملآملآملآملآملآملآملآملآملآملآملآملآملآملآمل",
    "device_id": 2,
  },
  {"name": "موتورخانه 3", "status": "فعال", "city": "زنجان", "device_id": 3},
  {"name": "موتورخانه 4", "status": "فعال", "city": "آمل", "device_id": 4},
  {
    "name": "موتورخانه 2",
    "status": "غیرفعال",
    "city": "آملآملآملآملآملآملآملآملآملآملآملآملآملآملآملآملآملآملآمل",
    "device_id": 5,
  },
  {"name": "موتورخانه 3", "status": "فعال", "city": "زنجان", "device_id": 6},
  {"name": "موتورخانه 4", "status": "فعال", "city": "آمل", "device_id": 1},
  {"name": "موتورخانه 3", "status": "فعال", "city": "زنجان", "device_id": 7},
  {"name": "موتورخانه 4", "status": "فعال", "city": "آمل", "device_id": 8},
];

const logsSampleData = [
  {
    "title": "پیام ادمینپیام ادمینپیام ادمینپیام ادمینپیام ادمینپیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "سپنتا شفیع زاده",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 1,
  },
  {
    "title": "بازدید، سرویس، راه‌اندازی سالیانه",
    "message":
        "سنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "شرکت گاز مازندران - اداره خلیل شهر",
    "event_id": 2,
  },
  {
    "title": "پیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 3,
  },
  {
    "title": "پیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 4,
  },
  {
    "title": "پیام ادمینپیام ادمینپیام ادمینپیام ادمینپیام ادمینپیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "سپنتا شفیع زاده",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 1,
  },
  {
    "title": "بازدید، سرویس، راه‌اندازی سالیانه",
    "message":
        "سنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "شرکت گاز مازندران - اداره خلیل شهر",
    "event_id": 1,
  },
  {
    "title": "پیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 1,
  },
  {
    "title": "پیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 1,
  },
  {
    "title": "پیام ادمینپیام ادمینپیام ادمینپیام ادمینپیام ادمینپیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "سپنتا شفیع زاده",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 1,
  },
  {
    "title": "بازدید، سرویس، راه‌اندازی سالیانه",
    "message":
        "سنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گرددسنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "شرکت گاز مازندران - اداره خلیل شهر",
    "event_id": 1,
  },
  {
    "title": "پیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 1,
  },
  {
    "title": "پیام ادمین",
    "message": "سنسور دمای برگشت باید تعویض گردد",
    "author": "admin",
    "device": "دانشگاه مازندران - پردیس - سالن ورزشی قائم",
    "event_id": 1,
  },
];
